{
    "test_questions": [
      {
        "id": 1,
        "question": "Qual foi o faturamento total da loja no último mês?",
        "description": "Calcula o total de revenue da tabela orders_ia filtrando pelo último mês."
      },
      {
        "id": 2,
        "question": "Quantos pedidos foram feitos nos últimos 7 dias?",
        "description": "Conta o número de orderid na tabela orders_ia onde creationdate está dentro da última semana."
      },
      {
        "id": 3,
        "question": "Quais são os 5 produtos mais vendidos em quantidade nos últimos 3 meses?",
        "description": "Agrupa os produtos na tabela orders_items_ia pelo campo idprod e ordena pelo total de quantityorder vendido nos últimos 3 meses."
      },
      {
        "id": 4,
        "question": "Qual categoria de produto gerou mais receita no último ano?",
        "description": "Soma o revenue_without_shipping agrupando pelo campo namecategory na tabela orders_items_ia e ordena pelo maior faturamento."
      },
      {
        "id": 5,
        "question": "Qual é o valor médio do ticket de compra dos clientes?",
        "description": "Calcula a média de revenue da tabela orders_ia para obter o ticket médio."
      },
      {
        "id": 6,
        "question": "Quais são os 3 métodos de pagamento mais utilizados pelos clientes?",
        "description": "Agrupa os pedidos na tabela orders_ia pelo campo paymentnames e conta a frequência de cada método."
      },
      {
        "id": 7,
        "question": "Qual é o estado brasileiro que mais fez compras na loja?",
        "description": "Agrupa os pedidos na tabela orders_ia pelo campo selectedaddresses_0_state e ordena pelo número total de pedidos."
      },
      {
        "id": 8,
        "question": "Qual é o percentual de pedidos que receberam frete grátis?",
        "description": "Calcula a proporção de pedidos onde isfreeshipping é 'true' sobre o total de pedidos na tabela orders_ia."
      },
      {
        "id": 9,
        "question": "Os clientes do sexo feminino ou masculino gastam mais na média?",
        "description": "Agrupa os pedidos na tabela orders_ia pelo campo sexo e calcula a média de gasto (revenue) por grupo."
      },
      {
        "id": 10,
        "question": "Qual foi o produto com maior valor de comissão pago para a loja?",
        "description": "Seleciona o maior valor de commission na tabela orders_items_ia e retorna o namesku do produto correspondente."
      }
    ]
  }
  